namespace Kernel.Common;

public enum OpCode : byte
{
    // === 1. Системные команды ===
    NOP, // Нет операции (пропуск такта)
    END, // Остановка процессора / завершение программы
    PRINT,

    // === 2. Работа с памятью (Указатели и регистры) ===
    MOV, // Копировать значение из регистра в регистр (MOV R1, R2)
    LOAD, // Загрузить в регистр число из памяти по адресу (LOAD R1, [R2])
    STORE, // Записать число из регистра в память по адресу (STORE [R1], R2)
    LDI, // Загрузить константу (Immediate) прямо в регистр (LDI R1, 42)
    LOAD_IND,
    STORE_IND,

    // === 3. Арифметика и Логика (Тьюринг-базис) ===
    ADD, // Сложение (ADD R1, R2 -> R1 = R1 + R2)
    SUB, // Вычитание (SUB R1, R2 -> R1 = R1 - R2)
    MULT_INT, //Умножение (MULT_INT R1 R2 -> R1 = R1 * R2)
    SHR, //Деление SHR r1, r2 (r1 = r1 >> r2)
    INC, // Инкремент значения в регистре (INC R1)
    DEC, // Декремент значения в регистре (DEC R1)
    DIV,

    // === 4. Логика (нужна для битовых масок и флагов) ===
    AND, // Побитовое И
    OR, // Побитовое ИЛИ
    XOR, // Побитовое исключающее ИЛИ (часто используется для обнуления: XOR R1, R1)
    NOT, // Побитовое НЕ

    // === 5. Управление потоком (Ветвление и Указатели команд) ===
    JMP, // Безусловный переход по адресу (JMP 0x05)
    JZ, // Переход, если результат последней операции равен нулю (Jump if Zero)
    JNZ, // Переход, если результат НЕ равен нулю (Jump if Not Zero)
    JG, // Переход, если первое число больше второго (Jump if Greater)
    JL, // Переход, если первое число меньше второго (Jump if Less)

    // === 6. Работа со Стеком (необходима для вызова функций) ===
    PUSH, // Положить значение регистра в стек
    POP, // Забрать значение из стека в регистр
    CALL, // Вызов подпрограммы (сохраняет адрес возврата в стек и делает JMP)
    RET,  // Возврат из подпрограммы (делает POP адреса возврата в Instruction Pointer)

    // === 7. Ввод-вывод ===
    IN,  // Чтение из порта: IN Rdest, Rport  (Rdest ← порт[Rport])
    OUT,  // Запись в порт:  OUT Rsrc, Rport  (порт[Rport] ← Rsrc)
    PRINT_INT, 
    INT,   // программное прерывание
    IRET,   // возврат из прерывания

    ALLOC,
    HALT,
    WAKE,

    WAKE_INT,

    LOAD_UNSAFE,
    STORE_UNSAFE,
    STORE_IND_UNSAFE,
    LOAD_IND_UNSAFE,
    CMP,
    TEST,
}

